# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [5]:
# your answer here

import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [60]:
# your answer here

employee = pd.read_csv('./data/Employee.csv')

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [11]:
# Method 1
# your answer here

display(employee.groupby(['Department'])['Salary'].agg(np.average))

Department
HR       45.00
IT       48.75
Sales    55.00
Name: Salary, dtype: float64

In [12]:
# Method 2
# your answer here

display(employee.pivot_table(index = ['Department'], values = ['Salary']))

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [13]:
# your answer here
display(employee.pivot_table(index = ['Department','Title'], values = ['Salary']))

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [73]:
# your answer here
employee.pivot_table(index = ['Title'], values = ['Years', 'Salary'])

           Salary  Years
Title
VP          73.75   5.00
analyst     32.50   2.25
associate   56.25   3.50

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [70]:
# your answer here
employee.pivot_table(index = ['Department', 'Title'], values = ['Salary','Name'], aggfunc = {'Salary':'mean', 'Name':'count'}).rename({'Name':'No. of employees'}, axis = 1)

                      No. of employees  Salary
Department Title
HR         VP                        2    75.0
           analyst                   2    32.5
IT         VP                        2    72.5
           analyst                   2    32.5
           associate                 2    57.5
Sales      associate                 2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [21]:
# your answer here
display(employee.pivot_table(index = ['Department', 'Title'], values = ['Salary'], aggfunc = ['min','max','median', np.std]))
#Comment: stdev cannot be calculated for three groups as there is only a single employee there

                        min    max median       std
                     Salary Salary Salary    Salary
Department Title
HR         VP            70     70   70.0       NaN
           analyst       30     35   32.5  3.535534
IT         VP            70     70   70.0       NaN
           analyst       30     35   32.5  3.535534
           associate     60     60   60.0       NaN
Sales      associate     55     55   55.0  0.000000

#### Based on your comments, fill the missing values with an appropriate value.

In [65]:
# your answer here
# We need to come up with some fake data

#employee_new = pd.DataFrame([['Alex', 'HR', 'Phd', 'M', 'VP', 1, 80], ['Liz', 'IT', 'Master', 'F', 'VP', 3, 75], ['Barb', 'IT', 'Bachelor', 'F', 'associate', 2, 55]], columns = employee.columns)
#employee = employee.append(employee_new).reset_index()

# Re-running the previous task
employee.pivot_table(index = ['Department', 'Title'], values = ['Salary'], aggfunc = ['min','max','median', np.std])

                        min    max median       std
                     Salary Salary Salary    Salary
Department Title
HR         VP            70     80   75.0  7.071068
           analyst       30     35   32.5  3.535534
IT         VP            70     75   72.5  3.535534
           analyst       30     35   32.5  3.535534
           associate     55     60   57.5  3.535534
Sales      associate     55     55   55.0  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [68]:
# your answer here
employee.pivot_table(index = ['Department'], values = ['Salary','Name'], aggfunc = {'Salary':'sum', 'Name':'count'}).rename({'Name':'No. of employees'}, axis = 1)

            No. of employees  Salary
Department
HR                         4     215
IT                         6     325
Sales                      2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [72]:
# your answer here
employee.pivot_table(index = ['Department', 'Title'], values = ['Salary','Years'], aggfunc = {'Salary':'mean', 'Years':'sum'})

                      Salary  Years
Department Title
HR         VP           75.0      9
           analyst      32.5      6
IT         VP           72.5     11
           analyst      32.5      3
           associate    57.5      9
Sales      associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [81]:
# your answer here


def no_maxima_mean(x):
    return (sum(x)-max(x))/(len(x)-1)

display(employee.pivot_table(index = ['Department'], values = ['Salary'], aggfunc = {'Salary': no_maxima_mean})) # No maxima
display(employee.pivot_table(index = ['Department'], values = ['Salary'], aggfunc = {'Salary': 'mean'})) # Full, for reference

            Salary
Department
HR              45
IT              50
Sales           55

               Salary
Department
HR          53.750000
IT          54.166667
Sales       55.000000